### GroupBy Sorguları

In [1]:
import numpy as np
import pandas as pd

In [20]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [21]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet']}

In [22]:
df = pd.DataFrame(dataset)

In [23]:
df

          Departman  Maaş  Çalışan
0           Bilişim  3000  Mustafa
1  İnsan Kaynakları  3500     Jale
2            Üretim  2500    Kadir
3            Üretim  4500   Zeynep
4           Bilişim  4000    Murat
5  İnsan Kaynakları  2000    Ahmet

In [24]:
DepGroup = df.groupby("Departman")

In [25]:
DepGroup

In [26]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [27]:
TotalPriceB = DepGroup.sum().loc["Bilişim"]

In [64]:
int(TotalPriceB)

7000

In [29]:
df.groupby("Departman").count()

                  Maaş  Çalışan
Departman
Bilişim              2        2
Üretim               2        2
İnsan Kaynakları     2        2

In [30]:
df.groupby("Departman").max()

                  Maaş  Çalışan
Departman
Bilişim           4000  Mustafa
Üretim            4500   Zeynep
İnsan Kaynakları  3500     Jale

In [40]:
minPriceB = df.groupby("Departman").min()["Maaş"]["Bilişim"]

In [41]:
minPriceB

3000

In [61]:
averagePriceB = df.groupby("Departman").mean().loc["Bilişim"]["Maaş"]

In [62]:
averagePriceB

3500